In [1]:
import pandas as pd 

data=[1,3,4,5,6]
s=pd.Series([data])
s

0    [1, 3, 4, 5, 6]
dtype: object

In [4]:
student={"name":["ram","ragul","krish"],
         "tamil":[90,80,67],
         "english":[22,44,69],
         "maths":[90,89,66]}
student["name"]

['ram', 'ragul', 'krish']

In [3]:
dataframe=pd.DataFrame(student)
dataframe

    name  tamil  english  maths
0    ram     90       22     90
1  ragul     80       44     89
2  krish     67       69     66

In [5]:
dataframe["name"]

0      ram
1    ragul
2    krish
Name: name, dtype: object

In [6]:
#Locate Row


print(dataframe.loc[1])

name       ragul
tamil         80
english       44
maths         89
Name: 1, dtype: object

In [8]:
print(dataframe.loc[[0]])

  name  tamil  english  maths
0  ram     90       22     90

In [12]:
l=[[1],45]
l[0][0]

1

In [9]:
print(dataframe.loc[[0,1]])

SyntaxError: invalid syntax (900752037.py, line 1)

In [13]:
import pandas as pd 
student={"name":["ram","ragul","krish"],
         "tamil":[90,80,67],
         "english":[22,44,69],
         "maths":[90,89,66]}



df = pd.DataFrame(student, index = ["stu1", "stu2", "stu3"])

df

       name  tamil  english  maths
stu1    ram     90       22     90
stu2  ragul     80       44     89
stu3  krish     67       69     66

In [14]:
df.loc[["stu1"]]

     name  tamil  english  maths
stu1  ram     90       22     90

In [15]:
# Create a Series
ages = pd.Series([25, 30, 35])

print(ages)

0    25
1    30
2    35
dtype: int64

In [49]:
ages[0]

25

In [8]:

data = {'Name': ['Alice', 'Bob', 'Charlie'], 
        'Age': [25, 30, 35], 
        'Score': [85, 90, 95]}
df = pd.DataFrame(data, index=['a', 'b', 'c'])
print(df)

      Name  Age  Score
a    Alice   25     85
b      Bob   30     90
c  Charlie   35     95

In [9]:
print(df.loc['a'])

Name     Alice
Age         25
Score       85
Name: a, dtype: object

In [10]:
print(df.iloc[0])

Name     Alice
Age         25
Score       85
Name: a, dtype: object

0     1
1     2
2    34
dtype: int64